Repository: msdx/gradle-translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: To customize the settings for the Maven installer (seeSection 52.6.3, “Installing to the local repository”), you can do:
zh_cn: 要为 Maven installer（见第 52.6.3 条，“安装到本地资源库”) 自定义设置，你可以：

source: To customize these you can do:
zh_cn: 如果要自定义这些你可以这样做：

source: To deal with problems due to version conflicts, reports with dependency graphs are also very helpful.
zh_cn: 为了解决版本冲突问题，报告依赖关系图也是很有帮助的。

source: To define a configuration:
zh_cn: 如果要定义配置：

source: To define a new source set, you simply reference it in the sourceSets { } block.
zh_cn: 要定义一个新的源集，你只需在sourceSets {}块中引用它。

source: To define an Ivy repository which fetches Ivy files and artifacts from different locations, you can use the pattern layout with separate patterns to use to locate the Ivy files and artifacts:
zh_cn: 若要定义一个从不同的位置获取 Ivy 文件和 artifacts 的 Ivy 仓库，您可以使用模式布局，每个单独的模式用于定位到 Ivy 文件和 artifacts：

source: To define an Ivy repository with a non-standard layout, you can define a pattern layout for the repository:
zh_cn: 若要定义非标准布局的 Ivy 仓库，你可以定义一个仓库模式布局：

source: To define such a repository, you can do:
zh_cn: 要定义一个这样的仓库，你可以这样：

source: To define the main-class for the application you have to set the mainClassName property as shown below
zh_cn: 若要为应用程序定义 main-class，你必须如下所示设置mainClassName属性

source: To define the name for the distribution you have to set the baseName property as shown below:
zh_cn: 若要定义 distribution 的名称，必须如下所示设置baseName属性：

source: To disable the build of the depended on projects you can run Gradle with the -a option.
zh_cn: 如果要禁止依赖项目的构建，你可以使用-a 选项运行 Gradle。

source: To do so, we add a method to the task and mark it with the TaskAction annotation.
zh_cn: 要添加一些行为，我们需要添加一个方法到这个任务中，并且使用 TaskAction 注解来标记它。

source: To do the same for project dependencies you need to declare:
zh_cn: 同样的项目依赖，你需要声明：

source: To do this, you need to define a custom configuration for the classpath, then add some dependencies to the configuration.
zh_cn: 要做到这一点，你需要定义一个自定义配置的类路径中，然后将一些依赖项添加到配置中。

source: To enable dynamic resolve mode, you need to set the appropriate option on the repository definition.
zh_cn: 若要启用动态解析模式，你需要在仓库定义进行合适的设置。

source: To enable historical builds, you need to keep all the past libraries and you need a backup.
zh_cn: 要启用历史版本，你需要保留所有过去的库，并且需要备份。

source: To facilitate their manipulation, values still have their "idiomatic" type (File, List, etc.).
zh_cn: 为了方便它们的操作，这些值值仍然使用它们惯用的类型 （File，List等）。

source: To generate the build dashboard, simply include the buildDashboard task in the list of tasks to execute.
zh_cn: 如果要生成 build dashboard，只需在要执行的任务列表中包含 buildDashboard 任务。

source: To get started, apply the JaCoCo plugin to the project you want to calculate code coverage for.
zh_cn: 要想开始，请将 JaCoCo 插件应用于你想要计算代码覆盖率的项目中。

source: To get started, apply the Sonar Runner plugin to the project to be analyzed.
zh_cn: 若要开始，请对要分析的项目配置使用 Sonar Runner 插件。

source: To get the library files of the configuration dependencies you can do:
zh_cn: 要获得配置依赖的library文件，你可以这样：

source: To have access to the complete API, either with the map or with the string notation, you can assign a single dependency to a configuration together with a closure.
zh_cn: 要访问完整的 API，使用 map 或 string 标记法，你可以把单个的依赖与一个闭包一起指定给一个配置。

source: To implement a custom task class, you extend DefaultTask.
zh_cn: 要实现一个自定义任务类，你需要继承DefaultTask。

source: To improve responsiveness Gradle caches all compiled scripts by default.
zh_cn: 为了提高响应速度，默认情况下 Gradle 会缓存所有已编译的脚本。

source: To include any static files in the distribution, simply arrange them in the src/dist directory, or add it to the content of the distribution.
zh_cn: 如果要在 distribution 中包括任何的静态文件，只需要把它们放在 src/dist 目录。

source: To include any static files in the distribution, simply arrange them in the src/dist directory.
zh_cn: 如果要在 distribution 中包括任何的静态文件，只需要把它们放在src/dist目录。

source: To learn more about executing external processes with Groovy have a look in 'Groovy in Action' 9.3.2 or at the Groovy wiki
zh_cn: 要了解更多关于使用 Groovy 执行外部进程的内容，可以看一下《Groovy in Action》的9.3.2章节，或者是 Groovy wiki

source: To learn more about generic manifest handling, see Section 23.13.1, “Manifest”.
zh_cn: 要了解常见的清单处理的更多信息，请参阅第 23.13.1节，“Manifest”。

source: To learn more about installing to the local repository, see: Section 52.6.3, “Installing to the local repository”
zh_cn: 要了解更多关于安装到本地资源库的内容，请参阅：第 52.6.3 节，“安装到本地仓库”

source: To learn more about the API of the configuration class see the API documentation: Configuration.
zh_cn: 想了解更多关于这个配置类的API，可以参阅它的 API 文档：Configuration.

source: To learn more about the Gradle Maven POM object, see MavenPom.
zh_cn: 如果要了解关于 Gradle Maven POM 对象的更多信息，请参阅MavenPom。

source: To learn more about the available instructions have a look at the BND tool.
zh_cn: 要了解更多关于 instructions 的信息，可以看看BND tool。

source: To learn more about this API have a look at ConfigurationContainer.
zh_cn: 要了解更多关于此 API 的内容，可以看看ConfigurationContainer。

source: To learn more about this have a look at PomFilterContainer and its associated classes.
zh_cn: 要了解更多关于它的信息，你可以看一下PomFilterContainer和其关联的类。

source: To make custom tasks available in your build, you can use the taskdef (usually easier) or typedef Ant task, just as you would in a build.xml file.
zh_cn: 要使自定义任务在您的构建中可用，你可以使用Ant 任务 taskdef（通常更容易） 或typedef，就像在build.xml文件中一样。

source: To meet these needs, the plugins adds a task dependency from sonarRunner on test if the java plugin is applied.
zh_cn: 为了满足这些需要，如果应用了java插件，Sonar Runner 插件将从sonarRunner添加一个对 test 的任务依赖。

source: To override the Zinc version that Gradle uses by default, add an explicit Zinc dependency (for example zinc "com.typesafe.zinc:zinc:0.1.4").
zh_cn: 如果要重写 Gradle 默认情况下使用的 Zinc 版本，请添加一个显式的 Zinc 依赖项 （例如zinc "com.typesafe.zinc:zinc:0.1.4"）。

source: To refer to a task in another project, you prefix the name of the task with the path of the project it belongs to.
zh_cn: 要引用另一个项目中的任务，你需要把它所属的项目的路径作为前缀加到它的名字中。

source: To refresh all dependencies in the dependency cache, use the --refresh-dependencies option on the command line.
zh_cn: 要刷新依赖缓存中的所有依赖项，请使用--refresh-dependencies命令行选项。

source: To retrieve classified dependencies from a Maven repository you can write:
zh_cn: 如果你想从一个 Maven 仓库中获取 classified 依赖项，你可以这样写：

source: To run your web application, you apply the Jetty plugin to your project:
zh_cn: 若要运行您的 web 应用程序，您要将 Jetty 插件应用于您的项目：

source: To show more of the power of configuration injection, let's add another project called tropicalFish and add more behavior to the build via the build script of the water project.
zh_cn: 若要体现配置注入的更强大之处，让我们添加另一个项目tropicalFish，并通过water项目的构建脚本向这个构建添加更多的行为。

source: To specify a "must run after" or "should run after" ordering between 2 tasks, you use the Task.mustRunAfter() and Task.shouldRunAfter() methods.
zh_cn: 如果想指定两个任务之间的“必须在之后运行”和“应该在之后运行”排序，可以使用Task.mustRunAfter()和Task.shouldRunAfter()方法。

source: To specify a finalizer task you use the Task.finalizedBy() method.
zh_cn: 你可以使用Task.finalizedBy()方法指定一个析构器任务。

source: To specify the destination directory, use the CopySpec.into() method.
zh_cn: 使用CopySpec.into()方法使用目标目录。

source: To switch the ScalaCompile task from the default Ant based compiler to the new Zinc based compiler, set scalaCompileOptions.useAnt to false:
zh_cn: 若要把ScalaCompile任务从默认的基于 Ant 的编译器切换为新的基于 Zinc 的编译器，需要将 scalaCompileOptions.useAnt设置为false：

source: To this end, the core 'native-binary' plugins will attempt to locate and make available supported tool chains.
zh_cn: 为此，核心的“native-binary”将尝试查找并使支持的工具链可用。

source: To use Gradle's up-to-date checking, you need to declare the inputs and outputs of the task.
zh_cn: 若要使用 Gradle 的最新状态（up-to-date）检查，您需要声明这个任务的输入和输出。

source: To use an Ivy repository with a standard layout:
zh_cn: 使用一个标准布局的 Ivy 存储库：

source: To use the Copy task, you must provide a set of source files to copy, and a destination directory to copy the files to.
zh_cn: 若要使用Copy任务，您必须提供用于复制的源文件和目标目录。

source: To use the ANTLR plugin, include in your build script:
zh_cn: 要使用 ANTLR 插件，请在构建脚本中包含以下语句：

source: To use the Build Dashboard plugin, include the following in your build script:
zh_cn: 要使用 Build Dashboard 插件，请在生成脚本中包括:

source: To use the Checkstyle plugin, include in your build script:
zh_cn: 要使用 Checkstyle 插件，请在构建脚本中包含以下语句：

source: To use the CodeNarc plugin, include in your build script:
zh_cn: 要使用 CodeNarc 插件，请在构建脚本中包含以下语句：

source: To use the Ear plugin, include in your build script:
zh_cn: 要使用 Ear 的插件，请在构建脚本中包含以下语句：

source: To use the Eclipse plugin, include this in your build script:
zh_cn: 要使用 Eclipse 插件，请在构建脚本中包含以下语句：

source: To use the FindBugs plugin, include in your build script:
zh_cn: 要使用 FindBugs 插件，请在构建脚本中包含以下语句：

source: To use the Groovy library that ships with Gradle, declare a localGroovy() dependency.
zh_cn: 如果要使用 Gradle 所带的 Groovy 库，请声明localGroovy()依赖。

source: To use the Groovy plugin, add the following to your build file:
zh_cn: 要使用Groovy插件，你需要在构建脚本文件当中添加以下内容：

source: To use the Groovy plugin, include in your build script:
zh_cn: 要使用 Groovy 的插件，请在构建脚本中包含以下语句：

source: To use the IDEA plugin, include this in your build script:
zh_cn: 要使用 IDEA 插件，请在构建脚本中包含以下语句：

source: To use the JDepend plugin, include in your build script:
zh_cn: 要使用 JDepend 插件，请在构建脚本中包含以下语句：

source: To use the Java library distribution plugin, include in your build script:
zh_cn: 要使用 Java 分发插件，请在构建脚本中加入：

source: To use the Java plugin, include in your build script:
zh_cn: 要使用 Java 插件，请在构建脚本中加入：

source: To use the Jetty plugin, include in your build script:
zh_cn: 要使用 Jetty 的插件，请在构建脚本中包含以下语句：

source: To use the Maven plugin, include in your build script:
zh_cn: 要使用 Maven 插件，请在构建脚本中包含以下语句：

source: To use the OSGi plugin, include in your build script:
zh_cn: 要使用 OSGi 插件，请在构建脚本中包含以下语句：

source: To use the PMD plugin, include in your build script:
zh_cn: 要使用 PMD 插件，请在构建脚本中包含以下语句：

source: To use the Project report plugin, include in your build script:
zh_cn: 要使用项目报告插件，请在构建脚本中包含以下语句：

source: To use the Scala plugin, include in your build script:
zh_cn: 要使用 Scala 插件，请在构建脚本中包含以下语句：

source: To use the Signing plugin, include in your build script:
zh_cn: 要使用 Signing 插件，请在构建脚本中包含以下语句：

source: To use the War plugin, include in your build script:
zh_cn: 要使用 War 的插件，请在构建脚本中包含以下语句：

source: To use the announce plugin, apply it to your build script:
zh_cn: 要使用 announce 插件，请在构建脚本中包含以下语句：

source: To use the application plugin, include in your build script:
zh_cn: 要使用这个应用程序插件，请在构建脚本中包含以下语句：

source: To use the build announcements plugin, include in your build script:
zh_cn: 要使用构建公告插件，请在生成脚本中包括:

source: To use the classpath configuration, use the asPath property of the custom configuration.
zh_cn: 若要使用类路径配置，请使用自定义配置里的asPath属性。

source: To use the distribution plugin, include in your build script:
zh_cn: 要使用分发插件，请在构建脚本中包含以下语句：

source: To use the groovy compilation tasks, you must also declare the Groovy version to use and where to find the Groovy libraries.
zh_cn: 要使用groovy编译任务，还必须声明要使用的Groovy版本以及从哪里获取Groovy库。

source: To use the local Maven cache as a repository you can do:
zh_cn: 你可以这样把本地的 Maven 缓存作为仓库使用：

source: To use the plugin, simply execute the task named init where you would like to create the Gradle build.
zh_cn: 如果要使用该插件，只需要在你想要的地方，执行名为init 的任务，就可以创建 Gradle 构建。

source: To use this task type, you need to define a destinationDir and the test results to include in the report.
zh_cn: 要使用这个任务类型，你需要定义一个destinationDir和要包含到报告的测试结果。

source: Tool Chain
zh_cn: 工具链

source: Top level element that enables configuration of the Eclipse plugin in a DSL-friendly fashion
zh_cn: 顶级元素，以DSL友好的方式启用 Eclipse 插件的配置

source: Top level element that enables configuration of the idea plugin in a DSL-friendly fashion
zh_cn: 顶级元素，以DSL友好的方式启用 idea 插件的配置

source: Transitive dependency management is a technique that enables your project to depend on libraries which, in turn, depend on other libraries.
zh_cn: 传递依赖管理是一种技术，让你的项目能够依赖那些反过来依赖其他库的库。

source: Troubleshooting
zh_cn: 疑难解答

source: Truncated stacktraces are printed.
zh_cn: 输出截断的栈跟踪。

source: Tutorial - 'This and That'
zh_cn: 教程 - 杂七杂八

source: Tutorials
zh_cn: 教程

source: Two of the configurations are relevant for the usage with artifacts.
zh_cn: 这两个配置都与构件的使用有关。

source: Two projects are said to be decoupled if they do not directly access each other's project model.
zh_cn: 如果两个项目不能直接访问彼此的项目模型，那么可以说它们是解耦的。

source: Type
zh_cn: 类型

source: Typical build types are 'debug' and 'release', but a project is free to define any set of build types.
zh_cn: 典型的构建类型是“debug”和“release”，但一个project可以自由定义任意的构建类型。

source: Typically (but not necessarily) this will be the root project of the Gradle build.
zh_cn: 通常（但不是一定）会是这个 Gradle 构建的根项目。

source: Typically (but not necessarily) this will be the root project.
zh_cn: 通常（但不是一定）会是根项目。

source: Typically, these are compile tasks, test tasks, and code coverage tasks.
zh_cn: 通常情况下，它们是编译任务、测试任务和代码覆盖任务。

source: Under *nix it is probably preferable to run this as a background task (gradle --gui&)
zh_cn: 如果是在linux/unix系统下，则可以通过 (gradle --gui&)让它作为后台任务运行。

source: Understanding how the build language works will help you when you write your build script, and in particular, when you start to write custom plugins and tasks.
zh_cn: 了解构建语言是如何工作的，将有助于你编写构建脚本，特别是当你开始写自定义插件和任务的时候。

source: Unless groovyOptions.useAnt is set to true, Gradle's native Groovy compiler integration is used.
zh_cn: 除非groovyOptions.useAnt设置为true，否则将使用 Gradle 集成的本地的 Groovy 编译器。

source: Unless Sonar is run locally and with default settings, it is necessary to configure connection settings for the Sonar server and database.
zh_cn: 除非 Sonar 是在本地上运行，并且有默认的配置，否则有必要配置Sonar 服务器及数据库的连接设置。

source: Unless a task's groovyClasspath is configured explicitly, the Groovy (base) plugin will try to infer it from the task's classpath.
zh_cn: 除非显式配置了一个 task 的groovyClasspath ，否则 Groovy（基础）插件会尝试推断该 task 的classpath。

source: Unless a task's scalaClasspath is configured explicitly, the Scala (base) plugin will try to infer it from the task's classpath.
zh_cn: 除非显式配置了一个 task 的scalaClasspath ，否则 Scala（基础）插件会尝试推断该 task 的classpath。

source: Unless you provide specific number of parallel threads Gradle attempts to choose the right number based on available CPU cores.
zh_cn: 除非你提供了特定数量的并行线程，否则Gradle 将基于可用的 CPU 内核尝试选择正确的线程数。

source: Unlike the Sonar plugin, the Sonar Runner plugin works fine with Sonar 3.4 and higher.
zh_cn: 不同于 Sonar 插件，Sonar Runner 插件与 Sonar 3.4 或更高的版本一起使用时也表现正常。

source: Unpacking
zh_cn: 解压

source: Until then, the Sonar Runner is executed in the main Gradle process.
zh_cn: 到那时，Sonar Runner 会在 Gradle 主进程中执行。

source: Uploading
zh_cn: 上传

source: Uploading to a Maven repository is described in Section 52.6, “Interacting with Maven repositories”.
zh_cn: 关于上传到Maven仓库的内容，在52.6节，“与Maven仓库的交互”中描述。

source: Uploads the artifacts in the archives configuration, including the JAR file.
zh_cn: 使用archives配置上传包括 JAR 文件的构件。

source: Usage
zh_cn: 用法

source: Usage and troubleshooting
zh_cn: 用法和故障排除

source: Use sudo apt-get install libnotify-bin to install it.
zh_cn: 使用 sudo apt-get install libnotify-bin 来安装它。

source: Use Custom Gradle Executor - Advanced feature
zh_cn: 使用自定义的 Gradle 执行器 - 高级功能

source: Used by tasks
zh_cn: 在哪些任务中使用

source: Used for
zh_cn: 用于

source: Uses JUnit for testing
zh_cn: 使用JUnit测试

source: Uses ScalaTest is used for testing
zh_cn: 使用ScalaTest作为测试

source: Uses Spock testing framework for testing
zh_cn: 测试使用 Spock testing framework

source: Uses Groovy 2.x
zh_cn: 使用 Groovy 2.x

source: Uses Scala 2.10
zh_cn: 使用 Scala 2.10

source: Uses effective POM and effective settings (support for POM inheritance, dependency management, properties)
zh_cn: 使用有效的 POM 和有效设置（支持 POM 继承、 依赖管理、 属性）

source: Uses the " mavenCentral() dependency repository
zh_cn: 使用“mavenCentral()”依赖仓库

source: Uses the "groovy" plugin
zh_cn: 使用“groovy”插件

source: Uses the "java" plugin
zh_cn: 使用“java”插件

source: Uses the "scala" plugin
zh_cn: 使用“scala”插件

source: Using Ant Tasks
zh_cn: 调用 Ant 任务

source: Using Ant from Gradle
zh_cn: 从 Gradle 中调用 Ant

source: Using Ant tasks and types in your build
zh_cn: 在构建中使用 Ant 任务和类型

source: Using Clang distributed with XCode.
zh_cn: 使用 XCode 中的 Clang。

source: Using GCC distributed with XCode.
zh_cn: 使用 XCode 中的 GCC。

source: Using custom descriptor file
zh_cn: 使用自定义的描述符文件

source: Using extra project properties is another.
zh_cn: 或者是使用额外的项目属性。

source: Using methods
zh_cn: 方法抽取

source: Using pre-built artifacts in the place of building dependent projects.
zh_cn: 在构建依赖项目时使用预构建的构件。

source: Using the Sync task
zh_cn: 使用Sync任务

source: Using the buildSrc project approach keeps separate the task declaration - that is, what the task should do - from the task implementation - that is, how the task does it.
zh_cn: 使用 buildSrc 项目的方法能够保持任务的声明——即它应该做什么，与这个任务的实现——即它是怎么做的，相互独立。

source: Using the Gradle Command-Line
zh_cn: 使用 Gradle 命令行

source: Using the Gradle Graphical User Interface
zh_cn: 使用Gradle 图形用户界面

source: Using the Signing DSL, you can specify that all of the artifacts of this configuration should be signed.
zh_cn: 使用Signing DSL，你可以指定这个配置的所有 artifacts 都应该被签名。

source: Using the contents of an archive as a file tree
zh_cn: 使用归档文件的内容作为文件树

source: Using the project name for filtering is one option.
zh_cn: 我们可以选择使用project的名称来筛选，

source: Using this descriptor you can change the name, project directory and build file of a project.
zh_cn: 使用这个描述符，你可以更改一个项目的名称、项目目录和构建文件。

source: Using this method is a useful way to convert some user provided value into an absolute File.
zh_cn: 这是把一些用户提供的值转换为一个相对路径的File对象的有用方法。

source: Using your project as a library can either happen from within a multi-project build or by retrieving your project from a repository.
zh_cn: 把一个项目作为类库使用，可能是因为多项目构建，也可能是从仓库中获取项目。

source: Usually we put the project specific behavior in the build script of the project where we want to apply this specific behavior.
zh_cn: 通常我们会把项目的特定行为放到我们想添加的这个项目的构建脚本里。

source: Usually, a real project will require more than this.
zh_cn: 通常情况下，一个真实的项目所需要的不止于此。

source: Usually, there is a method with the same name as the property, which appends to the set of files.
zh_cn: 通常情况下，有一个与属性相同名称的方法，可以追加这个文件集合。

source: Usually, you would pass it a String or File instance.
zh_cn: 通常情况下，你会传给它一个String或File的实例。

source: Utilize a pool of reusable processes available for compilation and testing.
zh_cn: 使用可用于编译和测试的一个可复用线程池。

source: Value of the current used JVM
zh_cn: 当前JVM所使用的值

source: Version 1.12
zh_cn: 版本 1.12

source: Versions in jar names increase the expressiveness of your project and make them easier to maintain.
zh_cn: 在 jar 文件中包含版本号提高了在你的项目中的表现，并且让它们更易于维护。

source: Via the -u command line option, you can tell Gradle not to look in the parent hierarchy for a settings.gradle file.
zh_cn: 通过-u命令行选项，你可以让 Gradle 不去父目录找settings.gradle文件。

source: Via the string notation you can define a subset of the properties.
zh_cn: 通过 string 标记法，你可以定义一个属性的子集。

source: WAR file base name
zh_cn: WAR 文件的base name

source: War plugin - tasks
zh_cn: War 插件 - tasks

source: Warning messages
zh_cn: 警告消息

source: We add a property to the producer project and create now a configuration time dependency from consumer on producer.
zh_cn: 我们添加一个属性到生产者项目，并且在生产者上创建一个来自消费者的配置时依赖。

source: We also offer inheritance for projects as you will see later.
zh_cn: 稍后您将看到，我们也提供了项目继承。

source: We also support the same mechanism for system properties.
zh_cn: 对系统属性我们也支持相同的机制。

source: We are not that happy with the build script of the water project.
zh_cn: 我们对这个 water 项目的构建脚本不是很满意。

source: We assign this library to a new dependency configuration.
zh_cn: 我们将这个库指定给一个新的依赖配置。

source: We came up with several use cases where the daemon is very useful.
zh_cn: 我们准备了几个守护进程非常有用的用例。

source: We can change this property simply by giving it a new value.
zh_cn: 我们可以简单地通过给它一个新的值来更改此属性。

source: We can change where the class files are written via the source set.
zh_cn: 我们可以通过这个源码集修改写入类文件的位置。

source: We can do better.
zh_cn: 我们可以进行改善。

source: We can force all of these libraries to use a consistent version:
zh_cn: 我们可以强制所有这些库使用一致的版本：

source: We could add project specific behavior for the bluewhale project like this:
zh_cn: 我们可以这样为bluewhale项目添加特定行为︰

source: We could also have used the following syntax:
zh_cn: 我们还可以使用下面的语法：

source: We could not find a good overview for all possible proxy settings.
zh_cn: 我们无法很好地概述所有可能的代理服务器设置。

source: We define the artifacts of the projects as the files the project provides to the outside world.
zh_cn: 我们把项目的构件定义为项目向外界提供的文件。

source: We don't run CI builds with the daemon (i.e. a long running process) as the CI environment is optimized for consistency and reliability.
zh_cn: 由于 CI 环境在一致性和可靠性上的优化，我们不通过守护进程运行 CI 构建（即长时间运行进程） 。

source: We execute the hello tasks of the water, the krill and the tropicalFish project.
zh_cn: 我们执行了water、krill和tropicalFish项目的hello任务。

source: We fork a separate daemon process if the jvm arguments for the build are sufficiently different.
zh_cn: 如果用于构建的jvm的参数足够不同，我们会fork一个单独的守护进程。

source: We fork a separate daemon process per java home.
zh_cn: 对每个java home，我们会fork一个单独的守护进程。

source: We have already seen how to define tasks using a keyword style in Chapter 6, Build Script Basics.
zh_cn: 在第 6 章，构建脚本基础 中我们已经看到如何通过关键字这种风格来定义任务。

source: We have an interesting set of dependencies.
zh_cn: 我们有一套有意思的依赖。

source: We have now declared that the action task in the consumer project has an execution dependency on the action task on the producer project.
zh_cn: 我们现在声明了consumer项目的action任务对producer项目上的action任务有执行依赖。

source: We have said that there is a specific upload task for each configuration.
zh_cn: 我们说过，每一个配置都有一个特定的上传任务。

source: We have seen these in Chapter 15, More about Tasks.
zh_cn: 我们在 第十五章 有关任务的详细信息中看到过它们。

source: We have seen these in Chapter 6, Build Script Basics.
zh_cn: 这样的任务我们在第六章， 构建脚本基础已经看到过。

source: We have seen this already in Section 6.13, “Configure by DAG”.
zh_cn: 在第 6.13 章，“使用DAG配置”我们已经看到进了。

source: We have the following project tree.
zh_cn: 我们有以下的项目树。

source: We have the projects shared, api andpersonService.
zh_cn: 我们有这些项目： shared， api 和personService。

source: We mention it for the sake of completeness and comparison with other build tools.
zh_cn: 我们提到它是为了完整性，以及和其他构建工具进行比较。

source: We need something better than this hack.
zh_cn: 我们需要比这种技巧更好的实现。

source: We plan to add much more to the existing reports and create additional ones in future releases of Gradle.
zh_cn: 我们计划在未来发布的版本中，向现有的报告添加更多的内容，以及创建额外的东西。

source: We plan to improve the ways of managing / pooling the daemons in future.
zh_cn: 我们计划在将来改进守护进程的managing / pooling的方法。

source: We recommend this over full stacktraces.
zh_cn: 我们推荐使用这一个选项而不是打印全栈的跟踪信息。

source: We said earlier that the build script defines a project in Gradle.
zh_cn: 我们之前说在 Gradle 中构建脚本定义了一个项目（project）。

source: We said earlier, that the core of Gradle is a language for dependency based programming.
zh_cn: 我们之前说，Gradle 的核心是一种以依赖为基础进行编程的语言。

source: We saw in the example above that the Java plugins adds a task named compileJava that has a property named destinationDir (that configures where the compiled Java source should be placed).
zh_cn: 在上面的示例中我们看到，Java 插件添加了一个任务，名字为compileJava ，有一个名为destinationDir 的属性（即配置编译的 Java 代码存放的地方）。

source: We simply switch to the consumer dir and execute the build.
zh_cn: 我们简单地切换到consumer目录并执行构建。

source: We think it provides a very powerful and flexible way of configuring multiproject builds.
zh_cn: 我们认为它提供了配置 multiproject 的构建非常强大和灵活的方式。

source: We usually put the project specific stuff into the build script of the respective projects.
zh_cn: 我们通常把项目的具体东西放到各自的项目的构建脚本里。

source: We will grow the the test filtering api and add more kinds of filters.
zh_cn: 我们将会继续改进测试过滤的API，并添加更多种类的过滤器。

source: We will have a closer look at this in the next section.
zh_cn: 我们将在下一节详细讨论这一点。

source: We will improve this in a future release of Gradle.
zh_cn: 我们将在未来版本的 Gradle 修正这一点。
